Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME70_DFP/4.5.86/same70a/include/component/pio.h
/**
 * \brief Component description for PIO
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2017-08-25T14:00:00Z */
#ifndef _SAME70_PIO_COMPONENT_H_
#define _SAME70_PIO_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PIO                                          */
/* ************************************************************************** */

/* -------- PIO_PER : (PIO Offset: 0x00) ( /W 32) PIO Enable Register -------- */
#define PIO_PER_P0_Pos                        _U_(0)                                               /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P0_Msk                        (_U_(0x1) << PIO_PER_P0_Pos)                         /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P0(value)                     (PIO_PER_P0_Msk & ((value) << PIO_PER_P0_Pos))      
#define PIO_PER_P1_Pos                        _U_(1)                                               /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P1_Msk                        (_U_(0x1) << PIO_PER_P1_Pos)                         /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P1(value)                     (PIO_PER_P1_Msk & ((value) << PIO_PER_P1_Pos))      
#define PIO_PER_P2_Pos                        _U_(2)                                               /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P2_Msk                        (_U_(0x1) << PIO_PER_P2_Pos)                         /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P2(value)                     (PIO_PER_P2_Msk & ((value) << PIO_PER_P2_Pos))      
#define PIO_PER_P3_Pos                        _U_(3)                                               /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P3_Msk                        (_U_(0x1) << PIO_PER_P3_Pos)                         /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P3(value)                     (PIO_PER_P3_Msk & ((value) << PIO_PER_P3_Pos))      
#define PIO_PER_P4_Pos                        _U_(4)                                               /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P4_Msk                        (_U_(0x1) << PIO_PER_P4_Pos)                         /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P4(value)                     (PIO_PER_P4_Msk & ((value) << PIO_PER_P4_Pos))      
#define PIO_PER_P5_Pos                        _U_(5)                                               /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P5_Msk                        (_U_(0x1) << PIO_PER_P5_Pos)                         /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P5(value)                     (PIO_PER_P5_Msk & ((value) << PIO_PER_P5_Pos))      
#define PIO_PER_P6_Pos                        _U_(6)                                               /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P6_Msk                        (_U_(0x1) << PIO_PER_P6_Pos)                         /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P6(value)                     (PIO_PER_P6_Msk & ((value) << PIO_PER_P6_Pos))      
#define PIO_PER_P7_Pos                        _U_(7)                                               /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P7_Msk                        (_U_(0x1) << PIO_PER_P7_Pos)                         /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P7(value)                     (PIO_PER_P7_Msk & ((value) << PIO_PER_P7_Pos))      
#define PIO_PER_P8_Pos                        _U_(8)                                               /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P8_Msk                        (_U_(0x1) << PIO_PER_P8_Pos)                         /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P8(value)                     (PIO_PER_P8_Msk & ((value) << PIO_PER_P8_Pos))      
#define PIO_PER_P9_Pos                        _U_(9)                                               /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P9_Msk                        (_U_(0x1) << PIO_PER_P9_Pos)                         /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P9(value)                     (PIO_PER_P9_Msk & ((value) << PIO_PER_P9_Pos))      
#define PIO_PER_P10_Pos                       _U_(10)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P10_Msk                       (_U_(0x1) << PIO_PER_P10_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P10(value)                    (PIO_PER_P10_Msk & ((value) << PIO_PER_P10_Pos))    
#define PIO_PER_P11_Pos                       _U_(11)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P11_Msk                       (_U_(0x1) << PIO_PER_P11_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P11(value)                    (PIO_PER_P11_Msk & ((value) << PIO_PER_P11_Pos))    
#define PIO_PER_P12_Pos                       _U_(12)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P12_Msk                       (_U_(0x1) << PIO_PER_P12_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P12(value)                    (PIO_PER_P12_Msk & ((value) << PIO_PER_P12_Pos))    
#define PIO_PER_P13_Pos                       _U_(13)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P13_Msk                       (_U_(0x1) << PIO_PER_P13_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P13(value)                    (PIO_PER_P13_Msk & ((value) << PIO_PER_P13_Pos))    
#define PIO_PER_P14_Pos                       _U_(14)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P14_Msk                       (_U_(0x1) << PIO_PER_P14_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P14(value)                    (PIO_PER_P14_Msk & ((value) << PIO_PER_P14_Pos))    
#define PIO_PER_P15_Pos                       _U_(15)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P15_Msk                       (_U_(0x1) << PIO_PER_P15_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P15(value)                    (PIO_PER_P15_Msk & ((value) << PIO_PER_P15_Pos))    
#define PIO_PER_P16_Pos                       _U_(16)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P16_Msk                       (_U_(0x1) << PIO_PER_P16_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P16(value)                    (PIO_PER_P16_Msk & ((value) << PIO_PER_P16_Pos))    
#define PIO_PER_P17_Pos                       _U_(17)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P17_Msk                       (_U_(0x1) << PIO_PER_P17_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P17(value)                    (PIO_PER_P17_Msk & ((value) << PIO_PER_P17_Pos))    
#define PIO_PER_P18_Pos                       _U_(18)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P18_Msk                       (_U_(0x1) << PIO_PER_P18_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P18(value)                    (PIO_PER_P18_Msk & ((value) << PIO_PER_P18_Pos))    
#define PIO_PER_P19_Pos                       _U_(19)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P19_Msk                       (_U_(0x1) << PIO_PER_P19_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P19(value)                    (PIO_PER_P19_Msk & ((value) << PIO_PER_P19_Pos))    
#define PIO_PER_P20_Pos                       _U_(20)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P20_Msk                       (_U_(0x1) << PIO_PER_P20_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P20(value)                    (PIO_PER_P20_Msk & ((value) << PIO_PER_P20_Pos))    
#define PIO_PER_P21_Pos                       _U_(21)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P21_Msk                       (_U_(0x1) << PIO_PER_P21_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P21(value)                    (PIO_PER_P21_Msk & ((value) << PIO_PER_P21_Pos))    
#define PIO_PER_P22_Pos                       _U_(22)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P22_Msk                       (_U_(0x1) << PIO_PER_P22_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P22(value)                    (PIO_PER_P22_Msk & ((value) << PIO_PER_P22_Pos))    
#define PIO_PER_P23_Pos                       _U_(23)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P23_Msk                       (_U_(0x1) << PIO_PER_P23_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P23(value)                    (PIO_PER_P23_Msk & ((value) << PIO_PER_P23_Pos))    
#define PIO_PER_P24_Pos                       _U_(24)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P24_Msk                       (_U_(0x1) << PIO_PER_P24_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P24(value)                    (PIO_PER_P24_Msk & ((value) << PIO_PER_P24_Pos))    
#define PIO_PER_P25_Pos                       _U_(25)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P25_Msk                       (_U_(0x1) << PIO_PER_P25_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P25(value)                    (PIO_PER_P25_Msk & ((value) << PIO_PER_P25_Pos))    
#define PIO_PER_P26_Pos                       _U_(26)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P26_Msk                       (_U_(0x1) << PIO_PER_P26_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P26(value)                    (PIO_PER_P26_Msk & ((value) << PIO_PER_P26_Pos))    
#define PIO_PER_P27_Pos                       _U_(27)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P27_Msk                       (_U_(0x1) << PIO_PER_P27_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P27(value)                    (PIO_PER_P27_Msk & ((value) << PIO_PER_P27_Pos))    
#define PIO_PER_P28_Pos                       _U_(28)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P28_Msk                       (_U_(0x1) << PIO_PER_P28_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P28(value)                    (PIO_PER_P28_Msk & ((value) << PIO_PER_P28_Pos))    
#define PIO_PER_P29_Pos                       _U_(29)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P29_Msk                       (_U_(0x1) << PIO_PER_P29_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P29(value)                    (PIO_PER_P29_Msk & ((value) << PIO_PER_P29_Pos))    
#define PIO_PER_P30_Pos                       _U_(30)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P30_Msk                       (_U_(0x1) << PIO_PER_P30_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P30(value)                    (PIO_PER_P30_Msk & ((value) << PIO_PER_P30_Pos))    
#define PIO_PER_P31_Pos                       _U_(31)                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P31_Msk                       (_U_(0x1) << PIO_PER_P31_Pos)                        /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P31(value)                    (PIO_PER_P31_Msk & ((value) << PIO_PER_P31_Pos))    
#define PIO_PER_Msk                           _U_(0xFFFFFFFF)                                      /**< (PIO_PER) Register Mask  */

#define PIO_PER_P_Pos                         _U_(0)                                               /**< (PIO_PER Position) PIO Enable */
#define PIO_PER_P_Msk                         (_U_(0xFFFFFFFF) << PIO_PER_P_Pos)                   /**< (PIO_PER Mask) P */
#define PIO_PER_P(value)                      (PIO_PER_P_Msk & ((value) << PIO_PER_P_Pos))         

